; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-6packages-803seed

(define (problem transport-two-cities-sequential-5nodes-1000size-3degree-100mindistance-2trucks-6packages-803seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 500,539 -> 111,191
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 53)
  ; 111,191 -> 500,539
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 53)
  ; 416,112 -> 111,191
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 32)
  ; 111,191 -> 416,112
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 32)
  ; 416,112 -> 500,539
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 44)
  ; 500,539 -> 416,112
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 44)
  ; 251,767 -> 500,539
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 34)
  ; 500,539 -> 251,767
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 34)
  ; 233,616 -> 111,191
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 45)
  ; 111,191 -> 233,616
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 45)
  ; 233,616 -> 500,539
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 28)
  ; 500,539 -> 233,616
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 28)
  ; 233,616 -> 251,767
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 16)
  ; 251,767 -> 233,616
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 16)
  ; 2561,12 -> 2604,146
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 15)
  ; 2604,146 -> 2561,12
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 15)
  ; 2753,61 -> 2604,146
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 18)
  ; 2604,146 -> 2753,61
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 18)
  ; 2753,61 -> 2561,12
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 20)
  ; 2561,12 -> 2753,61
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 20)
  ; 2869,153 -> 2604,146
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 27)
  ; 2604,146 -> 2869,153
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 27)
  ; 2869,153 -> 2561,12
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 34)
  ; 2561,12 -> 2869,153
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 34)
  ; 2869,153 -> 2753,61
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 15)
  ; 2753,61 -> 2869,153
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 15)
  ; 2353,25 -> 2604,146
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 28)
  ; 2604,146 -> 2353,25
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 28)
  ; 2353,25 -> 2561,12
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 21)
  ; 2561,12 -> 2353,25
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 21)
  ; 2353,25 -> 2753,61
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 41)
  ; 2753,61 -> 2353,25
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 41)
  ; 500,539 <-> 2353,25
  (road city-1-loc-2 city-2-loc-5)
  (= (road-length city-1-loc-2 city-2-loc-5) 193)
  (road city-2-loc-5 city-1-loc-2)
  (= (road-length city-2-loc-5 city-1-loc-2) 193)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-4)
  (at package-3 city-1-loc-5)
  (at package-4 city-1-loc-2)
  (at package-5 city-1-loc-4)
  (at package-6 city-1-loc-4)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-4)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-4)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-3)
  (at package-6 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 6
2. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 6
3. (drive truck-1 city-1-loc-2 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 6
4. (pick-up truck-1 city-1-loc-5 package-3 capacity-3 capacity-4)
   deleted: (at package-3 city-1-loc-5) (capacity truck-1 capacity-4)
   added: (in package-3 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 6
5. (drive truck-1 city-1-loc-5 city-1-loc-4)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-4)
   goals met: 0 of 6
6. (pick-up truck-1 city-1-loc-4 package-6 capacity-2 capacity-3)
   deleted: (at package-6 city-1-loc-4) (capacity truck-1 capacity-3)
   added: (in package-6 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 6
7. (pick-up truck-1 city-1-loc-4 package-5 capacity-1 capacity-2)
   deleted: (at package-5 city-1-loc-4) (capacity truck-1 capacity-2)
   added: (in package-5 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 6
8. (pick-up truck-1 city-1-loc-4 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-4) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 6
9. (drive truck-1 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 6
10. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 0 of 6
11. (drive truck-1 city-2-loc-5 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-3)
   goals met: 0 of 6
12. (drop truck-1 city-2-loc-3 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-0)
   added: (at package-5 city-2-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 6
13. (drop truck-1 city-2-loc-3 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-3) (capacity truck-1 capacity-2)
   goals met: 2 of 6
14. (drive truck-1 city-2-loc-3 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-5)
   goals met: 2 of 6
15. (drive truck-1 city-2-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 2 of 6
16. (pick-up truck-1 city-1-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-2) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 2 of 6
17. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 2 of 6
18. (pick-up truck-1 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 6
19. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 2 of 6
20. (drive truck-1 city-1-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 2 of 6
21. (drive truck-1 city-2-loc-5 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-5)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 6
22. (drop truck-1 city-2-loc-1 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-0)
   added: (at package-6 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 3 of 6
23. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 3 of 6
24. (drop truck-1 city-2-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 4 of 6
25. (drop truck-1 city-2-loc-2 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-2)
   added: (at package-4 city-2-loc-2) (capacity truck-1 capacity-3)
   goals met: 5 of 6
26. (drive truck-1 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-4)
   goals met: 5 of 6
27. (drop truck-1 city-2-loc-4 package-3 capacity-3 capacity-4)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-3)
   added: (at package-3 city-2-loc-4) (capacity truck-1 capacity-4)
   goals met: 6 of 6
